In [1]:
import pandas as pd

In [3]:
df=pd.read_csv('Employee.csv')

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 38 entries, 0 to 37
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Education       34 non-null     object
 1   JoiningYear     35 non-null     float64
 2   City            35 non-null     object
 3   PaymentTier     32 non-null     float64
 4   Age             35 non-null     float64
 5   Gender          34 non-null     object
 6   EverBenched     34 non-null     object
 7   Experien        34 non-null     float64
 8   current salary  34 non-null     object
 9   past salary     35 non-null     float64
dtypes: float64(5), object(5)
memory usage: 3.1+ KB

In [7]:
df.head()

,Education,JoiningYear,City,PaymentTier,Age,Gender,EverBenched,Experien,current salary,past salary
0,Bachelors,2017.0,Bangalore,3.0,34.0,Male,No,0.0,856352,752364.0
1,Bachelors,2013.0,Pune,1.0,28.0,Female,No,3.0,845695,742365.0
2,Bachelors,2014.0,New Delhi,3.0,38.0,Female,No,2.0,835038,732366.0
3,Masters,2016.0,Bangalore,3.0,27.0,Male,No,5.0,824381,722367.0
4,Masters,2017.0,Pune,3.0,24.0,Male,Yes,NaN,813724,712368.0

In [9]:
df.isnull().sum()

Education         4
JoiningYear       3
City              3
PaymentTier       6
Age               3
Gender            4
EverBenched       4
Experien          4
current salary    4
past salary       3
dtype: int64

In [11]:
bush_katak=df.isnull().sum()>0

In [13]:
bush_katak

Education         True
JoiningYear       True
City              True
PaymentTier       True
Age               True
Gender            True
EverBenched       True
Experien          True
current salary    True
past salary       True
dtype: bool

In [15]:
for col in df.columns[bush_katak]:
    if df[col].dtype=='object':
        df[col].fillna(df[col].mode()[0], inplace=True)
    else:
        df[col].fillna(df[col].mean(), inplace=True)

C:\Users\Public\Documents\ESTsoft\CreatorTemp\ipykernel_8816\3480344265.py:3: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df[col].fillna(df[col].mode()[0], inplace=True)
C:\Users\Public\Documents\ESTsoft\CreatorTemp\ipykernel_8816\3480344265.py:5: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df[col].fillna(df[col].mean(), inplace=True)

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 38 entries, 0 to 37
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Education       38 non-null     object
 1   JoiningYear     38 non-null     float64
 2   City            38 non-null     object
 3   PaymentTier     38 non-null     float64
 4   Age             38 non-null     float64
 5   Gender          38 non-null     object
 6   EverBenched     38 non-null     object
 7   Experien        38 non-null     float64
 8   current salary  38 non-null     object
 9   past salary     38 non-null     float64
dtypes: float64(5), object(5)
memory usage: 3.1+ KB

In [19]:
df.head()

,Education,JoiningYear,City,PaymentTier,Age,Gender,EverBenched,Experien,current salary,past salary
0,Bachelors,2017.0,Bangalore,3.0,34.0,Male,No,0.000000,856352,752364.0
1,Bachelors,2013.0,Pune,1.0,28.0,Female,No,3.000000,845695,742365.0
2,Bachelors,2014.0,New Delhi,3.0,38.0,Female,No,2.000000,835038,732366.0
3,Masters,2016.0,Bangalore,3.0,27.0,Male,No,5.000000,824381,722367.0
4,Masters,2017.0,Pune,3.0,24.0,Male,Yes,2.294118,813724,712368.0

In [21]:
bush_katak

Education         True
JoiningYear       True
City              True
PaymentTier       True
Age               True
Gender            True
EverBenched       True
Experien          True
current salary    True
past salary       True
dtype: bool

In [23]:
df.isnull().sum()

Education         0
JoiningYear       0
City              0
PaymentTier       0
Age               0
Gender            0
EverBenched       0
Experien          0
current salary    0
past salary       0
dtype: int64

# Yozuvli ustunlarni topamiz

In [25]:
yozuvli_ustun=df.select_dtypes(include=['object','category']).columns

In [27]:
yozuvli_ustun

Index(['Education', 'City', 'Gender', 'EverBenched', 'current salary'], dtype='object')

In [29]:
for col in yozuvli_ustun:
    print(f"column {col}: {df[col].nunique()}")

column Education: 3
column City: 3
column Gender: 2
column EverBenched: 2
column current salary: 34

In [31]:
df['current salary'].value_counts()

current salary
462043       5
856352       1
632555       1
621898       1
611241       1
579270       1
568613       1
557956       1
547299       1
653869       1
536642       1
525985       1
515328       1
koreanwon    1
494014       1
483357       1
643212       1
664526       1
845695       1
675183       1
685840       1
696497       1
dirham       1
717811       1
728468       1
739125       1
771096       1
781753       1
792410       1
803067       1
813724       1
824381       1
835038       1
472700       1
Name: count, dtype: int64

In [93]:
df['current salary'].unique()

array(['856352', '845695', '835038', '824381', '813724', '803067',
       '792410', '781753', '771096', '462043', '739125', '728468',
       '717811', 'dirham', '696497', '685840', '675183', '664526',
       '653869', '643212', '632555', '621898', '611241', '579270',
       '568613', '557956', '547299', '536642', '525985', '515328',
       'koreanwon', '494014', '483357', '472700'], dtype=object)

In [33]:
df['current salary']=pd.to_numeric(df['current salary'], errors='coerce')

In [35]:
df['current salary']

0     856352.0
1     845695.0
2     835038.0
3     824381.0
4     813724.0
5     803067.0
6     792410.0
7     781753.0
8     771096.0
9     462043.0
10    462043.0
11    739125.0
12    728468.0
13    717811.0
14         NaN
15    696497.0
16    685840.0
17    675183.0
18    664526.0
19    653869.0
20    643212.0
21    632555.0
22    621898.0
23    611241.0
24    462043.0
25    462043.0
26    579270.0
27    568613.0
28    557956.0
29    547299.0
30    536642.0
31    525985.0
32    515328.0
33         NaN
34    494014.0
35    483357.0
36    472700.0
37    462043.0
Name: current salary, dtype: float64

In [41]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 38 entries, 0 to 37
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Education       38 non-null     object
 1   JoiningYear     38 non-null     float64
 2   City            38 non-null     object
 3   PaymentTier     38 non-null     float64
 4   Age             38 non-null     float64
 5   Gender          38 non-null     object
 6   EverBenched     38 non-null     object
 7   Experien        38 non-null     float64
 8   current salary  36 non-null     float64
 9   past salary     38 non-null     float64
dtypes: float64(6), object(4)
memory usage: 3.1+ KB

In [43]:
yozuvli_ustun

Index(['Education', 'City', 'Gender', 'EverBenched', 'current salary'], dtype='object')

In [45]:
df.isnull().sum()

Education         0
JoiningYear       0
City              0
PaymentTier       0
Age               0
Gender            0
EverBenched       0
Experien          0
current salary    2
past salary       0
dtype: int64

In [47]:
df['current salary'].fillna(df['current salary'].mean(), inplace=True)

In [49]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 38 entries, 0 to 37
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Education       38 non-null     object
 1   JoiningYear     38 non-null     float64
 2   City            38 non-null     object
 3   PaymentTier     38 non-null     float64
 4   Age             38 non-null     float64
 5   Gender          38 non-null     object
 6   EverBenched     38 non-null     object
 7   Experien        38 non-null     float64
 8   current salary  38 non-null     float64
 9   past salary     38 non-null     float64
dtypes: float64(6), object(4)
memory usage: 3.1+ KB

In [53]:
yozuvli_ustun

Index(['Education', 'City', 'Gender', 'EverBenched', 'current salary'], dtype='object')

In [57]:
df['current salary']

0     856352.000000
1     845695.000000
2     835038.000000
3     824381.000000
4     813724.000000
5     803067.000000
6     792410.000000
7     781753.000000
8     771096.000000
9     462043.000000
10    462043.000000
11    739125.000000
12    728468.000000
13    717811.000000
14    638475.555556
15    696497.000000
16    685840.000000
17    675183.000000
18    664526.000000
19    653869.000000
20    643212.000000
21    632555.000000
22    621898.000000
23    611241.000000
24    462043.000000
25    462043.000000
26    579270.000000
27    568613.000000
28    557956.000000
29    547299.000000
30    536642.000000
31    525985.000000
32    515328.000000
33    638475.555556
34    494014.000000
35    483357.000000
36    472700.000000
37    462043.000000
Name: current salary, dtype: float64

In [59]:
from sklearn.preprocessing import LabelEncoder
encoder=LabelEncoder()

In [60]:
df[yozuvli_ustun]=df[yozuvli_ustun].apply(encoder.fit_transform)

In [61]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 38 entries, 0 to 37
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Education       38 non-null     int32
 1   JoiningYear     38 non-null     float64
 2   City            38 non-null     int32
 3   PaymentTier     38 non-null     float64
 4   Age             38 non-null     float64
 5   Gender          38 non-null     int32
 6   EverBenched     38 non-null     int32
 7   Experien        38 non-null     float64
 8   current salary  38 non-null     int64
 9   past salary     38 non-null     float64
dtypes: float64(5), int32(4), int64(1)
memory usage: 2.5 KB

In [131]:
df.head()

,Education,JoiningYear,City,PaymentTier,Age,Gender,EverBenched,Experien,current salary,past salary
0,0,2017.0,0,3.0,34.0,1,0,0.000000,32,752364.0
1,0,2013.0,2,1.0,28.0,0,0,3.000000,31,742365.0
2,0,2014.0,1,3.0,38.0,0,0,2.000000,30,732366.0
3,1,2016.0,0,3.0,27.0,1,0,5.000000,29,722367.0
4,1,2017.0,2,3.0,24.0,1,1,2.294118,28,712368.0

In [65]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 38 entries, 0 to 37
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Education       38 non-null     int32
 1   JoiningYear     38 non-null     float64
 2   City            38 non-null     int32
 3   PaymentTier     38 non-null     float64
 4   Age             38 non-null     float64
 5   Gender          38 non-null     int32
 6   EverBenched     38 non-null     int32
 7   Experien        38 non-null     float64
 8   current salary  38 non-null     int64
 9   past salary     38 non-null     float64
dtypes: float64(5), int32(4), int64(1)
memory usage: 2.5 KB

In [67]:
from sklearn.preprocessing import LabelEncoder, MinMaxScaler, StandardScaler, RobustScaler

In [71]:
standard_scaler = StandardScaler()
df_standard_scaled = pd.DataFrame(standard_scaler.fit_transform(df), columns=df.columns)

In [73]:
df_standard_scaled.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 38 entries, 0 to 37
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Education       38 non-null     float64
 1   JoiningYear     38 non-null     float64
 2   City            38 non-null     float64
 3   PaymentTier     38 non-null     float64
 4   Age             38 non-null     float64
 5   Gender          38 non-null     float64
 6   EverBenched     38 non-null     float64
 7   Experien        38 non-null     float64
 8   current salary  38 non-null     float64
 9   past salary     38 non-null     float64
dtypes: float64(10)
memory usage: 3.1 KB

In [75]:
df_standard_scaled.head()

,Education,JoiningYear,City,PaymentTier,Age,Gender,EverBenched,Experien,current salary,past salary
0,-0.710047,1.023200,-0.823842,0.773133,0.680272,0.597614,-0.235702,-1.420891,1.749593,1.696156
1,-0.710047,-1.250578,1.584311,-2.525568,-0.471801,-1.673320,-0.235702,0.437197,1.650951,1.603252
2,-0.710047,-0.682134,0.380235,0.773133,1.448320,-1.673320,-0.235702,-0.182166,1.552310,1.510349
3,0.516398,0.454756,-0.823842,0.773133,-0.663813,0.597614,-0.235702,1.675923,1.453668,1.417445
4,0.516398,1.023200,1.584311,0.773133,-1.239850,0.597614,4.242641,0.000000,1.355026,1.324541

In [77]:
# Min-Max Scaling
min_max_scaler = MinMaxScaler()
df_min_max_scaled = pd.DataFrame(min_max_scaler.fit_transform(df), columns=df.columns)

In [79]:
df_min_max_scaled.head()

,Education,JoiningYear,City,PaymentTier,Age,Gender,EverBenched,Experien,current salary,past salary
0,0.0,0.833333,0.0,1.0,0.666667,1.0,0.0,0.000000,1.00000,1.000000
1,0.0,0.166667,1.0,0.0,0.333333,0.0,0.0,0.600000,0.96875,0.972973
2,0.0,0.333333,0.5,1.0,0.888889,0.0,0.0,0.400000,0.93750,0.945946
3,0.5,0.666667,0.0,1.0,0.277778,1.0,0.0,1.000000,0.90625,0.918919
4,0.5,0.833333,1.0,1.0,0.111111,1.0,1.0,0.458824,0.87500,0.891892

In [81]:
# Robust Scaling (handles outliers better)
robust_scaler = RobustScaler()
df_robust_scaled = pd.DataFrame(robust_scaler.fit_transform(df), columns=df.columns)

In [83]:
df_robust_scaled.head()

,Education,JoiningYear,City,PaymentTier,Age,Gender,EverBenched,Experien,current salary,past salary
0,0.0,0.466667,0.0,0.0,0.538776,0.000000,0.0,-1.073529,1.028571,1.043265
1,0.0,-0.866667,2.0,-2.0,-0.318367,-1.333333,0.0,0.426471,0.971429,0.986122
2,0.0,-0.533333,1.0,0.0,1.110204,-1.333333,0.0,-0.073529,0.914286,0.928980
3,1.0,0.133333,0.0,0.0,-0.461224,0.000000,0.0,1.426471,0.857143,0.871837
4,1.0,0.466667,2.0,0.0,-0.889796,0.000000,1.0,0.073529,0.800000,0.814694